# Taps
tap 'homebrew/bundle'

# Binaries
brew 'atuin'
brew 'autoconf'
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'coreutils'
brew 'eza'
brew 'fastfetch'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'go'
brew 'grep'
brew 'httpie'
brew 'icdiff'
brew 'libpq'
brew 'luarocks'
brew 'mas'
brew 'neovim'
brew 'oniguruma'
brew 'openssl'
brew 'pkg-config'
brew 'ripgrep'
brew 'starship'
brew 'stripe-cli'
brew 'thefuck'
brew 'watchman'
brew 'websocat'
brew 'zellij'

# Node
brew 'volta'

# Apps
cask '1password'
cask '1password-cli'
cask 'appcleaner'
cask 'brave-browser'
cask 'claude'
cask 'claude-code'
cask 'dbngin'
cask 'figma'
cask 'folx'
cask 'ghostty'
cask 'google-chrome'
cask 'herd'
cask 'iina'
cask 'imageoptim'
cask 'localsend'
cask 'orbstack'
cask 'phpstorm'
cask 'plex'
cask 'ray'
cask 'raycast'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'transmit'
cask 'vagrant'
cask 'virtualbox'
cask 'yaak'
cask 'zoom'

# App Store Apps
mas 'Amphetamine', id: 937984704

# Fonts
cask 'font-inter'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-lato'
cask 'font-open-sans'
