# Taps
tap 'hashicorp/tap'
tap 'homebrew/bundle'

# Binaries
brew 'atuin'
brew 'autoconf'
brew 'bash'
brew 'bat'
brew 'coreutils'
brew 'gh'
brew 'git'
brew 'grep'
brew 'hashicorp/tap/hashicorp-vagrant'
brew 'httpie'
brew 'icdiff'
brew 'mas'
brew 'oniguruma'
brew 'openssl@1.1'
brew 'pkg-config'
brew 'ripgrep'
brew 'stripe-cli'
brew 'thefuck'

# Node
brew 'volta'

# Apps
cask '1password'
cask '1password-cli'
cask 'brave-browser'
cask 'claude'
cask 'colorsnapper'
cask 'figma'
cask 'folx'
cask 'herd'
cask 'imageoptim'
cask 'orbstack'
cask 'phpstorm'
cask 'plex'
cask 'raycast'
cask 'slack'
cask 'spotify'
cask 'tableplus'
cask 'transmit'
cask 'virtualbox'
cask 'warp'
cask 'yaak'
cask 'zoom'

# App Store Apps
mas 'Amphetamine', id: 937984704
mas 'Giphy Capture', id: 668208984

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-inter'
